{
  "zh-cn": "MIUI第560周发布公告及更新日志",
  "en-us": "The 560th MIUI Weekly Update Changelogs",
  "CnBBSID": "",
  "CnComID": "36774460",
  "GbBBSID": "",
  "update": "2022.08.12",
  "versions": "",
  "showdevices": "0",
  "vid": "",
  "devices": [],
  "tpd":[],
  "addons": [
    {
      "zh-cn": "升级说明",
      "en-us": "Update instruction",
      "details": [
        {
          "zh-cn": "MIUI开发版可进入“设置→我的设备→MIUI版本”在线升级，升级前务必备份重要数据",
          "en-us": "You can upgrade MIUI China Beta by 'Settings→My Device→MIUI version', please make sure you've backed up important personal data before update."
        },
        {
          "zh-cn": "部分机型可能因功能进版时间略有差异，具体功能请以手机端展示日志为准",
          "en-us": "Some devices will get these same features later some time, please view specific changelog in the 'System Update' App."
        },
        {
          "zh-cn": "开发版：是提供给少数资深极客精神米粉的测试版本，用于问题反馈和测试，稳定性不可预估，感谢勇敢冒险者试用开发版。版本根据项目需要和实际情况发布，存在停版的可能，推荐发烧友米粉尝鲜体验，遇到问题请理性反馈，关注后续版本升级。",
          "en-us": "China Beta: China Beta is a test version that MIUI Dev Team prepared for Geeky Mi Fans, more focused on feature testing and bug feedback, stablity is not predictable, We(MIUI Dev Team) thank you for all your support. Version is released according to the needs of the project and the actual situation, and there is a possibility of suspension, If you encounter bugs, please send us bug report in Xiaomi Community(China), and pay attention to the subsequent upgrade."
        },
        {
          "zh-cn": "为提升用户体验，MIUI系统部分APP解耦合，在应用商店可升级，是MIUI系统的一部分。开发版不断迭代中，部分修复有时可能不完全显示在当天公告日志里，感谢大家的理解",
          "en-us": "In order to improve the user experience, bunch of the MIUI system APPs are Deodexed and can be upgraded in the Mi GetApps/Google Play . As a part of the MIUI system, some APPs bug fixes may not be included in this changelog , thank you for your understanding."
        }
      ]
    },
    {
      "zh-cn": "版本说明",
      "en-us": "Version Information",
      "details": [
        {
          "zh-cn": "Redmi K50至尊版 首次发布MIUI开发版, 多项优化与改进, 向勇敢尝鲜的米粉们致敬",
          "en-us": "We're releasing MIUI China Beta for Redmi K50 Ultra for the first time, includes minor improvements ,salute to our early adapter fans."
        },
        {
          "zh-cn": "小米平板5 Pro 12.4 已发布V13.1.22.9.2.DEV版本，感谢米粉朋友们的支持和理解",
          "en-us": "We've released patch version V13.1.22.9.2.DEV for Mi Pad 5 Pro 12.4, thank you for your understanding."
        },
        {
          "zh-cn": "Redmi K50 Pro、Xiaomi 12 Pro 已通过基于 Android 13的MIUI开发版招募的米粉朋友，已为大家发布V13.1.22.9.1.DEV版本，感谢米粉朋友们的理解和支持",
          "en-us": "We've released MIUI Update V13.1.22.9.1.DEV based on Android 13 for Redmi K50 Pro & Xiaomi 12 Pro for recruited members, thank you for your understanding."
        },
        {
          "zh-cn": "Xiaomi 12 已通过基于 Android 13的MIUI开发版招募的米粉朋友，已为大家发布V13.1.22.8.31.DEV版本，感谢米粉朋友们的理解和支持",
          "en-us": "We've released MIUI Update V13.1.22.8.31.DEV based on Android 13 for Xiaomi 12 for recruited members, thank you for your understanding."
        },
        {
          "zh-cn": "Redmi K50电竞版 已通过基于 Android 13的MIUI开发版招募的米粉朋友，已为大家发布V13.1.22.8.30.DEV版本，感谢米粉朋友们的理解和支持",
          "en-us": "We've released MIUI Update V13.1.22.8.30.DEV based on Android 13 for Redmi K50G for recruited members, thank you for your understanding."
        },
        {
          "zh-cn": "由于Android大版本升级，Xiaomi 12 Pro、Xiaomi 12 2022年9月2日起暂停发布基于Android 12的MIUI开发版，感谢大家的支持和理解",
          "en-us": "We're suspending MIUI updates based on Android 12 for Xiaomi 12 Pro & Xiaomi 12 since September 2, 2022, thank you for your understanding."
        },
        {
          "zh-cn": "由于Android大版本升级，Redmi K50 电竞版 2022年9月9日起暂停发布基于Android 12的MIUI开发版，感谢大家的支持和理解",
          "en-us": "We're suspending MIUI updates based on Android 12 for Redmi K50G since September 9, 2022, thank you for your understanding."
        },
        {
          "zh-cn": "由于为配合软件系统架构变更，开发版部分机型版本号有变更，感谢米粉朋友们的理解",
          "en-us": "Because of structural changes, MIUI China Beta version naming scheme has altered for some devices, thank you for your understanding."
        },
        {
          "zh-cn": "如卡刷未切换成功的米粉朋友，请将数据完整备份电脑后，尝试线刷方法进行切换包",
          "en-us": "If you failed switching to MIUI Beta via recovery flash, please update via fastboot."
        },
        {
          "zh-cn": "为了给米粉朋友们相对更好的使用体验，我们将会对MIUI开发模式进行升级",
          "en-us": "For better user experience, we've deviced make some changes to our development methods."
        },
        {
          "zh-cn": "开发版不断迭代中，因不同机型的系统底层存在部分差异，部分修复可能不完全显示在当天公告日志里，希望给大家相对更好的使用体验，感谢大家的支持和理解",
          "en-us": "MIUI China Beta is in continuous development, and because of structural differences, some changes may not be included in this changelog , thank you for your understanding."
        },
        {
          "zh-cn": "2022年10月31日起，以下机型将停止开发版内测公测：小米10 至尊纪念版、Redmi K30S 至尊纪念版、Redmi Note 9 Pro、Redmi Note 9 4G、Redmi 10X、Redmi 10X Pro、Redmi K30 至尊纪念版、Redmi Note 10、Redmi Note 11 5G、Redmi Note 11E Pro、Redmi Note 9",
          "en-us": "Starting from October 31, 2022, Mi 10 Ultra/Redmi K30S Ultra/Redmi K30 Ultra/Redmi Note 9 Pro/Redmi Note 9 4G/Redmi 10X/Redmi 10X Pro/Redmi Note 10/Redmi Note 11 5G/Redmi Note 11E Pro/Redmi Note 9 stops rolling MIUI China Beta updates."
        }
      ]
    }
  ],
  "logs": [
    {
      "zh-cn": "MIUI第560周发布公告及更新日志",
      "en-us": "The 560th MIUI Weekly Update Changelogs",
      "log": [
        {
          "zh-cn": "系统",
          "en-us": "System",
          "changes": [
            {
              "zh-cn": "修复部分场景下无法关闭纯净模式，无法验证密码的问题",
              "en-us": "Fixing the bug unabling to exit foxus mode and ubbaling password certification in some scenarios"
            }
          ]
        },
        {
          "zh-cn": "小米浏览器",
          "en-us": "Mi Browser",
          "changes": [
            {
              "zh-cn": "优化相关视频推荐体验",
              "en-us": "Optimizing 'Relevant Videos' suggestion experionces."
            }
          ]
        },
        {
          "zh-cn": "小米妙享",
          "en-us": "Mi Smart Hub",
          "changes": [
            {
              "zh-cn": "新增音箱播控，在系统级入口快捷操控音箱",
              "en-us": "New Smart Speaker controller integrated into the system"
            },
            {
              "zh-cn": "新增协同升级，在手机上一键升级电视",
              "en-us": "New Update syncs, you can update your TV via your phone now."
            },
            {
              "zh-cn": "新增手机获取平板应用，手机最近任务点击流转提示，在手机继续使用平板应用",
              "en-us": "Now you can get App captured and streamed to your phone and continously use the same app on both devices."
            },
            {
              "zh-cn": "新增剪贴板流转智能预测，平板、电脑复制电话、网址，手机端智能提示",
              "en-us": "New Clipboard share prediction mechanisim, you'll get a notification on your phone when coying on tablets."
            },
            {
              "zh-cn": "注：涉及平板端功能，小米平板5 Pro 12.4 出厂即支持，小米平板5系列需升级至8月11日的最新开发版或更高版本，稳定版请关注后续更新",
              "en-us": "Attention:Mi Pad 5 Pro 12.4 has those Tablet functionalities mentioned above bulit in, other Mi Pad 5 Series will need to upgrade to beta verion released on August 11, Stbale roms to follow."
            }
          ]
        }
      ]
    }
  ]
}
