{
  "titleCn": "MIUI第597周发布公告及更新日志",
  "titleEn": "The 597th MIUI Weekly Update Changelogs",
  "CnBBSID": "",
  "CnComID": "40312393",
  "GbBBSID": "",
  "update": "2023.04.28",
  "versions": "V14.0.23.4.25.DEV",
  "showdevices": "0",
  "vid": "",
  "no": "",
  "devices": [],
  "tpd":[],
  "addons": [
    {
      "titleCn": "升级说明",
      "titleEn": "Update instruction",
      "details": [
        {
          "Cn": "MIUI开发版可进入“设置→我的设备→MIUI版本”在线升级，升级前务必备份重要数据",
          "En": "You can upgrade MIUI China Beta by 'Settings→My Device→MIUI version', please make sure you've backed up important personal data before update."
        },
        {
          "Cn": "部分机型可能因功能进版时间略有差异，具体功能请以手机端展示日志为准",
          "En": "Some devices will get these same features later some time, please view specific changelog in the 'System Update' App."
        },
        {
          "Cn": "开发版：是提供给少数资深极客精神米粉的测试版本，用于问题反馈和测试，稳定性不可预估，感谢勇敢冒险者试用开发版。版本根据项目需要和实际情况发布，存在停版的可能，推荐发烧友米粉尝鲜体验，遇到问题请理性反馈，关注后续版本升级。",
          "En": "China Beta: China Beta is a test version that MIUI Dev Team prepared for Geeky Mi Fans, more focused on feature testing and bug feedback, stablity is not predictable, We(MIUI Dev Team) thank you for all your support. Version is released according to the needs of the project and the actual situation, and there is a possibility of suspension, If you encounter bugs, please send us bug report in Xiaomi Community(China), and pay attention to the subsequent upgrade."
        },
        {
          "Cn": "为提升用户体验，MIUI系统部分APP解耦合，在应用商店可升级，是MIUI系统的一部分。开发版不断迭代中，部分修复有时可能不完全显示在当天公告日志里，感谢大家的理解",
          "En": "In order to improve the user experience, bunch of the MIUI system APPs are Deodexed and can be upgraded in the Mi GetApps/Google Play . As a part of the MIUI system, some APPs bug fixes may not be included in this changelog , thank you for your understanding."
        }
      ]
    },
    {
      "titleCn": "版本说明",
      "titleEn": "Version Information",
      "details": [
        {
          "Cn": "为方便米粉朋友们浏览最新的MIUI玩机技巧等优质内容，和更多的米粉朋友们交流互动，MIUI开发版和MIUI正式版的精华内容会同时在小米社区“MIUI综合讨论区”圈内进行推荐，欢迎大家关注圈子，了解最新的MIUI动态资讯。",
          "En": "For better user experience on topics about MIUI new features and bug fixes and get better chat with MiFans, extradinary threads are both shared in 'All about MIUI' Board on Xiaomi Community Chinese site, we welcome all our user here."
        },
        {
          "Cn": "小米13 Ultra 预计2023年5月19日发布开发版，感谢米粉朋友们的支持和理解",
          "En": "China Beta for Xiaomi 13 Ultra is expected to launch May 19, 2023, thank you for your understanding."
        },
        {
          "Cn": "2023年08月04日起，以下机型将停止开发版内测公测：MIX FOLD折叠屏手机、Xiaomi MIX 4、小米平板5 Pro 5G、小米平板5 Pro Wi-Fi、小米平板5、Xiaomi Civi、Redmi Note11 Pro、Redmi Note11 Pro+、Xiaomi Civi 1S、Xiaomi 12X",
          "En": "Starting from August 04, 2023, MI MIX FOLD 、Xiaomi MIX 4、MiPad 5 Pro 5G、MiPad 5 Pro Wi-Fi、MiPad 5、Xiaomi Civi、Redmi Note11 Pro、Redmi Note11 Pro+、Xiaomi Civi 1S、Xiaomi 12X will stop rolling MIUI China Beta updates."
        },
        {
          "Cn": "为给米粉朋友们更好的安全体验，当开发版安全补丁版本，不高于正式版安全补丁时，才能切换版本成功。请切换选项消失或切换失败的米粉朋友备份数据到电脑后，参照刷机教程线刷，感谢大家的支持和理解。",
          "En": "You can switch between MIUI China Beta and MIUI Stable ROMs while current Android Security Patch is the same or lower than the other one, thanks for your understanding."
        },
        {
          "Cn": "为给米粉朋友们相对更好的版本使用体验，劳动节发版计划如下，提前祝米粉朋友们节日快乐   ①. 5月5日：开发版暂停发布②. 5月12日：开发版恢复发布",
          "En": "For better user experience during the International Worker's Day(May Day), we have planned to suspend MIUI China Beta updates. And ①. May 5th: Update is not scheduled. ②.May 12nd: Release continues."
        }
      ]
    }
  ],
  "logs": [
    {
      "titleCn": "MIUI第597周发布公告及更新日志",
      "titleEn": "The 597th MIUI Weekly Update Changelogs",
      "log": [
        {
          "componentCn": "桌面",
          "componentEn": "MIUI Home",
          "changes": [
            {
              "changesCn": "修复 部分场景桌面大文件夹图标显示异常的问题",
              "changesEn": "Fixing icons display errors within BigFolder in some scenarios"
            }
          ]
        }
      ]
    }
  ]
}
